<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"5fa215db43fc8e950bfbf2086b3e741a0d22e3dfdb1924ed98b391e0088edc64","plan_job_ref":"Job Terraform Plan #19 at https://github.com/cal-itp/gtfs.calitp.org/actions/runs/20384829757","plan_out_hash":"4c8f45be2c6110a13358703afac72f8570b266d36c97a43cdbc799a37d0873a6","plan_hash":"b27091288bb33a064d2cf5cc214a10a1f2fc046c29b26bd2b5a9b31fe7cb3388","plan_text_format":"diff","version":"2.2.2","closed":true} -->
Terraform plan in __iac/__
<details>
<summary>Plan: 2 to add, 2 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/ArtesiaGTFS.zip"] must be replaced
-/+ resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       content             = (sensitive value)
!~      content_type        = "application/zip" -> "application/octet-stream" # forces replacement
!~      crc32c              = "1CQyyQ==" -> (known after apply)
!~      detect_md5hash      = "PkylAlhyHzLqkU/ErLFmPg==" -> "different hash"
-       event_based_hold    = false -> null
!~      generation          = 1766182900269608 -> (known after apply)
!~      id                  = "**************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "PkylAlhyHzLqkU/ErLFmPg==" -> (known after apply)
!~      md5hexhash          = "3e4ca50258721f32ea914fc4acb1663e" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-gtfs/o/gtfs_files%2FArtesiaGTFS.zip?generation=1766182900269608&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "gtfs_files/ArtesiaGTFS.zip"
!~      output_name         = "gtfs_files/ArtesiaGTFS.zip" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-gtfs/o/gtfs_files%2FArtesiaGTFS.zip" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.gtfs-calitp-org["gtfs_files/MaywoodGTFS.zip"] must be replaced
-/+ resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       content             = (sensitive value)
!~      content_type        = "application/zip" -> "application/octet-stream" # forces replacement
!~      crc32c              = "GP6gEw==" -> (known after apply)
!~      detect_md5hash      = "t9SRT8SJ6KK3gsykdK+ZQA==" -> "different hash"
-       event_based_hold    = false -> null
!~      generation          = 1766182896732886 -> (known after apply)
!~      id                  = "**************************************" -> (known after apply)
+       kms_key_name        = (known after apply)
!~      md5hash             = "t9SRT8SJ6KK3gsykdK+ZQA==" -> (known after apply)
!~      md5hexhash          = "b7d4914fc489e8a2b782cca474af9940" -> (known after apply)
!~      media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-gtfs/o/gtfs_files%2FMaywoodGTFS.zip?generation=1766182896732886&alt=media" -> (known after apply)
-       metadata            = {} -> null
        name                = "gtfs_files/MaywoodGTFS.zip"
!~      output_name         = "gtfs_files/MaywoodGTFS.zip" -> (known after apply)
!~      self_link           = "https://www.googleapis.com/storage/v1/b/calitp-gtfs/o/gtfs_files%2FMaywoodGTFS.zip" -> (known after apply)
!~      storage_class       = "STANDARD" -> (known after apply)
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.gtfs-calitp-org["index.html"] will be updated in-place
!~  resource "google_storage_bucket_object" "gtfs-calitp-org" {
!~      crc32c              = "y1/7JA==" -> (known after apply)
!~      detect_md5hash      = "OglhcZeIZROnZ+/San6hng==" -> "different hash"
!~      generation          = 1749572407103719 -> (known after apply)
        id                  = "calitp-gtfs-index.html"
!~      md5hash             = "OglhcZeIZROnZ+/San6hng==" -> (known after apply)
        name                = "index.html"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.gtfs-calitp-org["sha.txt"] will be updated in-place
!~  resource "google_storage_bucket_object" "gtfs-calitp-org" {
!~      crc32c              = "MeN+hw==" -> (known after apply)
!~      detect_md5hash      = "3Fx6O9ahSA+7E9lPRM9jCQ==" -> "different hash"
!~      generation          = 1749572406723656 -> (known after apply)
        id                  = "calitp-gtfs-sha.txt"
!~      md5hash             = "3Fx6O9ahSA+7E9lPRM9jCQ==" -> (known after apply)
        name                = "sha.txt"
#        (16 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 2 to destroy.
```
</details>

:white_check_mark: Plan applied in [Terraform Apply #9](https://github.com/cal-itp/gtfs.calitp.org/actions/runs/20384850044)